[
    {
        "title": "How two modes of thinking helps to drive your development",
        "description": "Pair programming is a technical practice in which two engineers work together to  collaberatively produce one artifact. Usually, two engineers use one computer, sharing the keyboard. Both engineers must share their thoughts while working together.",
        "img": "",
        "link": "/blogs/pair_programming",
        "created_date":"03-27-2023",
        "updated_date":"03-27-2023",
        "tags": [
            "Appdev",
            "Devops"
        ]
    },
    {
        "title": "Taking a Spin with Test Driven Development",
        "description": "Test-Driven Development (TDD) is a technique for building software that guides software development by writing tests.",
        "img": "",
        "link": "/blogs/tdd",
        "created_date":"03-27-2023",
        "updated_date":"03-27-2023",
        "tags": [
            "Appdev"
        ]
    },
    {
        "title": "Why you should adopt Infrastructure as code",
        "description": "Traditionally Infrastructure Provisioning done manually, need to spend lot time and effort to provision, manage infrastructure. Due to fast paced technology we need to provision, manage and maintain much faster, Infrastructure as code come to a rescue to solve this issue. ",
        "img": "",
        "link": "/blogs/iac_intro",
        "created_date":"03-27-2023",
        "updated_date":"03-27-2023",
        "tags": [
            "Devops"
        ]
    },
    {
        "title": "How to provision, terminate EC2 Instance using Ansible",
        "description": "To destroy the EC2 instane that was created by the Ansible playbook, you can use the 'ec2' module's 'state' parameter with a value of 'absent'.",
        "img": "",
        "link": "/blogs/ansible_ec2",
        "created_date":"03-27-2023",
        "updated_date":"03-27-2023",
        "tags": [
            "Devops"
        ]
    },
    {
        "title": "How to secure your application while designing",
        "description": "Designing a system or application for security involves incorporating security considerations into the design process from the very beginning, in order to prevent vulnerabilities from arising in the first place.",
        "img": "",
        "link": "/blogs/design_security",
        "created_date":"03-27-2023",
        "updated_date":"03-27-2023",
        "tags": [
            "Appdev"
        ]
    }
]